podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/2.stage2Folder/peripherals/DMAMUX_MKE15Z7.svd.xml
<!--
Devices using this peripheral: 
      MKE15Z7
-->
      <peripheral>
         <?sourceFile "DMAMUX_MKE15Z7" ?>
         <name>DMAMUX</name>
         <description>DMA channel multiplexor</description>
         <groupName>DMAMUX</groupName>
         <prependToName>DMAMUX_</prependToName>
         <headerStructName>DMAMUX</headerStructName>
         <baseAddress>0x40021000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>CHCFG%s</name>
               <description>Channel Configuration register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (Slot)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable_Signal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TSI_Signal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>LPUART0_Rx_Signal</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>LPUART0_Tx_Signal</description>
                           <value>0b11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>LPUART1_Rx_Signal</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>LPUART1_Tx_Signal</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>LPUART2_Rx_Signal</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>LPUART2_Tx_Signal</description>
                           <value>0b111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FlexIO_Channel0_Signal</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>FlexIO_Channel1_Signal</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12</name>
                           <description>FlexIO_Channel2_Signal</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>13</name>
                           <description>FlexIO_Channel3_Signal</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>14</name>
                           <description>LPSPI0_Rx_Signal</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>15</name>
                           <description>LPSPI0_Tx_Signal</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16</name>
                           <description>LPSPI1_Rx_Signal</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>17</name>
                           <description>LPSPI1_Tx_Signal</description>
                           <value>0b10001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>18</name>
                           <description>LPI2C0_Rx_Signal</description>
                           <value>0b10010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>19</name>
                           <description>LPI2C0_Tx_Signal</description>
                           <value>0b10011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>20</name>
                           <description>FTM0_Channel0_Signal</description>
                           <value>0b10100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>21</name>
                           <description>FTM0_Channel1_Signal</description>
                           <value>0b10101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>22</name>
                           <description>FTM0_Channel2_Signal</description>
                           <value>0b10110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>23</name>
                           <description>FTM0_Channel3_Signal</description>
                           <value>0b10111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>24</name>
                           <description>FTM0_Channel4_Signal</description>
                           <value>0b11000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>25</name>
                           <description>FTM0_Channel5_Signal</description>
                           <value>0b11001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>26</name>
                           <description>FTM0_Channel6_Signal</description>
                           <value>0b11010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>27</name>
                           <description>FTM0_Channel7_Signal</description>
                           <value>0b11011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>28</name>
                           <description>FTM1_Channel0_Signal</description>
                           <value>0b11100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>29</name>
                           <description>FTM1_Channel1_Signal</description>
                           <value>0b11101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>30</name>
                           <description>FTM2_Channel0_Signal</description>
                           <value>0b11110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>31</name>
                           <description>FTM2_Channel1_Signal</description>
                           <value>0b11111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32</name>
                           <description>LPI2C1_Rx_Signal</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>33</name>
                           <description>LPI2C1_Tx_Signal</description>
                           <value>0b100001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>40</name>
                           <description>ADC0_Signal</description>
                           <value>0b101000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>41</name>
                           <description>ADC1_Signal</description>
                           <value>0b101001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>43</name>
                           <description>CMP0_Signal</description>
                           <value>0b101011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>44</name>
                           <description>CMP1_Signal</description>
                           <value>0b101100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>46</name>
                           <description>PDB0_Signal</description>
                           <value>0b101110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>49</name>
                           <description>PortA_Signal</description>
                           <value>0b110001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>50</name>
                           <description>PortB_Signal</description>
                           <value>0b110010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>51</name>
                           <description>PortC_Signal</description>
                           <value>0b110011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>52</name>
                           <description>PortD_Signal</description>
                           <value>0b110100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>53</name>
                           <description>PortE_Signal</description>
                           <value>0b110101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>57</name>
                           <description>FTM1_Channel2_Signal</description>
                           <value>0b111001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>58</name>
                           <description>FTM2_Channel2_Signal</description>
                           <value>0b111010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>59</name>
                           <description>LPTMR0_Signal</description>
                           <value>0b111011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>60</name>
                           <description>AlwaysOn60_Signal</description>
                           <value>0b111100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>61</name>
                           <description>AlwaysOn61_Signal</description>
                           <value>0b111101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>62</name>
                           <description>AlwaysOn62_Signal</description>
                           <value>0b111110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>63</name>
                           <description>AlwaysOn63_Signal</description>
                           <value>0b111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Triggering is disabled. If triggering is disabled and ENBL is set, the DMA Channel will simply route the specified source to the DMA channel. (Normal mode)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Triggering is enabled. If triggering is enabled and ENBL is set, the DMAMUX is in Periodic Trigger mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DMA channel is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
